tests/performance/load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  timeout: 30
  phases:
    # Phase 1 : Warm-up (montée en charge progressive)
    - duration: 60
      arrivalRate: 5
      name: "Warm up - 5 users/sec"
    
    # Phase 2 : Charge normale (utilisation standard)
    - duration: 180
      arrivalRate: 10
      name: "Normal load - 10 users/sec"
    
    # Phase 3 : Pic de charge
    - duration: 120
      arrivalRate: 20
      name: "Peak load - 20 users/sec"
    
    # Phase 4 : Retour à la normale
    - duration: 60
      arrivalRate: 5
      name: "Cool down - 5 users/sec"

  processor: "./helpers.js"

scenarios:
  - name: "Navigation utilisateur standard"
    weight: 60
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.message"
              as: "homeMessage"
      - think: 2
      
      - get:
          url: "/api/counters"
          capture:
            - json: "$[0].id"
              as: "counterId"
      - think: 1
      
      - post:
          url: "/api/counters/{{ counterId }}/increment"
          json:
            amount: 1
      - think: 2

  - name: "Lecture seule"
    weight: 30
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/api/counters"
      - think: 3

  - name: "Requêtes API intensives"
    weight: 10
    flow:
      - loop:
        - get:
            url: "/api/counters"
        - think: 0.5
        count: 5